[
{"title": "Apple is releasing a Mac mini with an Apple processor for developers starting this week", "author": "Darrell Etherington", "published_at": "2020-06-22 11:57:45", "content": "Apple  is eager to help developers transition to its forthcoming Apple system-on-a-chip-based Mac computers, and it’s preparing a number of resources to do that — including developer hardware. Apple’s Developer Transition Kit, which registered developers can apply for via its developer website, includes a Mac mini with an A12Z processor inside, running a pre-release version of macOS Big Sur.\n\nThe kit spec includes 16GB of RAM, as well as a 512GB SSD, and will come with Xcode preinstalled so that developers can get working on their apps right away. This is very much pre-release hardware, however — the first consumer Macs that run on Apple’s in-house silicon won’t ship until later this year, Apple CEO Tim Cook said during a keynote event for the company’s Worldwide Developers Conference (WWDC) on Monday.\n\nApple will also still be selling Intel-based Macs, including new ones still in the pipeline, as it transitions to using its own chips, a shift which it expects will take two years to cover the full Mac lineup. But these developer kits will begin shipping out as early as this week to developers who are approved for the program, Cook said — indicating that Apple is very eager to do what it can to get developers on board with the shift.\n\nIn addition to the Developer Transition Kit, Apple has created a Quickstart program to help guide developers through the process of making their apps universal to work natively on the new Apple silicon. That will offer sample code forums and documentation about how to work with the new SoCs. The DTK itself, which includes the hardware, will cost $500, and Apple says it will prioritize those developers who already have an existing macOS application to receive the kits due to limited availability.\n\nDeveloping…", "url": "https://techcrunch.com/2020/06/22/apple-is-releasing-a-mac-mini-with-an-apple-processor-for-developers-starting-this-week/"},
{"title": "Apple’s Safari will soon tell you all the ad trackers watching you", "author": "Zack Whittaker", "published_at": "2020-06-22 11:52:11", "content": "Apple  is turning the tables on invasive ad trackers.\n\nThe tech giant announced Monday a new privacy feature in its underdog browser, Safari, which will shine a spotlight on all of the ad trackers embedded on each article or website you visit.\n\nSafari’s new anti-tracking feature sits in the top part of the browser next to the address bar, and blocks intrusive trackers as you browse the web. Users can also open the anti-tracker and view a privacy report, which details all of the trackers on the page. \n\nThe page you’re reading, for example, had more than 200 trackers on it when we checked.\n\nRival browsers, like Firefox and Brave, already have anti-tracking features built in.\n\nIt’s the latest feature that tries to turn the tables on the targeted ad and tracking industry. As targeted advertising became more invasive over the years, Apple has responded by bundling features to its software, like its intelligence tracking prevention technology and allowing Safari users to install content blockers that prevent ads and trackers from loading.\n\nThe new Safari features will land in the latest version of macOS Big Sur, expected out later this year.", "url": "https://techcrunch.com/2020/06/22/apple-safari-ad-trackers/"},
{"title": "Watch the first trailer for ‘Foundation,’ coming to Apple TV+ in 2021", "author": "Anthony Ha", "published_at": "2020-06-22 11:54:37", "content": "While Apple  TV+ only played a small role in Apple’s announcements during today’s Worldwide Developers Conference keynote, the company did unveil the first teaser trailer for its upcoming “Foundation” series.\n\nThe show is based on the classic science fiction stories and novels by Isaac Asimov, which depict the fall of a Galactic Empire and the efforts of Hari Seldon, inventor of a new predictive science called psychohistory, to limit the period of chaos.\n\nThe teaser released online includes a little more footage than the version shown on the WWDC live stream, including comments from showrunner and executive producer David S. Goyer, who said, “People have been trying to make ‘Foundation’ for 50 years … It was the greatest science fiction work of all time.”\n\nThe teaser also includes some hints about how Goyer and the rest of the creative team are approaching the adaptation.\n\nWhile the books cover hundreds of years and feature an ever-changing cast of characters, it looks like Jared Harris will have an ongoing role as Seldon. (Though who knows, maybe he’ll disappear a few episodes in, just as he did in “The Crown.”) In addition, some key characters have been reconceived as women of color, and the whole thing looks much more visually spectacular than the action-light, dialogue-heavy stories.\n\n“Foundation” is due for release in 2021.", "url": "https://techcrunch.com/2020/06/22/watch-the-first-trailer-for-foundation-coming-to-apple-tv-in-2021/"},
{"title": "Lyft settles DOJ lawsuit alleging violation of Americans with Disabilities Act", "author": "Megan Rose Dickey", "published_at": "2020-06-22 12:19:28", "content": "Lyft  has agreed to settle a lawsuit from the U.S. Department of Justice that alleges the ridesharing company discriminated against disabled people — specifically those who use foldable wheelchairs or walkers.\n\nOne complainant, known as J.H. in the suit, alleged Lyft drivers denied giving him a ride on several occasions because of his collapsible wheelchair. As part of the settlement, Lyft has agreed to pay $42,000 to the four complainants and $40,000 to the U.S. Treasury.\n\nLyft is also now required to modify its wheelchair policy to clarify that drivers must help assist disabled people with wheelchairs, scooters and walkers. Lyft must also include information about its accessibility policies in the welcome email to new drivers, send quarterly reminders to drivers about the wheelchair policy and create an educational video about the wheelchair policy that highlights best practices for assisting riders.\n\nIf drivers fail to follow Lyft’s wheelchair policy, they may be removed from the Lyft platform. Throughout the duration of the agreement, which lasts three years, Lyft must provide written updates to the DOJ every six months regarding its compliance with the agreement.\n\n“We’re glad that through this agreement, we will continue improving our policies and making it easier for people with foldable wheelchairs and other collapsible mobility devices to get around using Lyft,” a Lyft spokesperson told TechCrunch. “Lyft is committed to maintaining an inclusive and welcoming community, and we’re proud that many people with disabilities who were previously underserved by existing transportation options now use Lyft as a reliable, safe, and affordable way to get around.”\n\nLyft has faced a number of accessibility-related discrimination lawsuits over the years. In the event that more lawsuits emerge, Lyft is now required to notify the DOJ within 30 days.\n\nCompetitor Uber has similarly faced its share of lawsuits pertaining to drivers discriminating against riders with wheelchairs. Both companies, however, have taken steps to rectify the problem. Last year, Lyft expanded its wheelchair-accessible vehicle service in New York while Uber has partnered with paratransit organizations to try to improve wait time for people with powered wheelchairs.\n\nIt’s worth pointing out the fine line Lyft is walking with its drivers, who are currently independent contractors, despite legislation in California that says otherwise. Since the start of the year, gig worker rights groups have urged companies like DoorDash, Uber, Lyft and Instacart to abide by AB 5. AB 5, which went into law earlier this year, outlines what type of worker can and cannot be classified as an independent contractor.\n\nThe law codifies the ruling established in Dynamex Operations West, Inc. v Superior Court of Los Angeles. In that case, the court applied the ABC test and decided Dynamex wrongfully classified its workers as independent contractors.\n\nAccording to the ABC test, in order for a hiring entity to legally classify a worker as an independent contractor, it must prove the worker is free from the control and direction of the hiring entity, performs work outside the scope of the entity’s business and is regularly engaged in work of some independently established trade or other similar business.\n\nStill, Lyft, Uber, Postmates, DoorDash and Instacart are funding a ballot measure that would seek to make it legal for them to classify workers as independent contractors.", "url": "https://techcrunch.com/2020/06/22/lyft-settles-doj-lawsuit-alleging-violation-of-americans-with-disabilities-act/"},
{"title": "Hulu announces a new offer-focused ad format called GatewayGo", "author": "Anthony Ha", "published_at": "2020-06-22 12:00:08", "content": "Hulu  is unveiling a new ad unit today, which it’s calling GatewayGo. The idea is to give viewers a way to directly interact with the advertisers and receive personalized offers.\n\nThis makes good on Hulu’s statement at the beginning of the year that it would be rolling out ads that are more transactional — so viewers can act on an ad right away, and advertisers get a concrete measurement of an ad’s impact.\n\nWhen someone sees a GatewayGo ad, it will include an option to receive more information or offers delivered to their phone or tablet via push notification, email or QR code. Initial advertisers include SmileDirectClub, The RealReal and Sweetgreen.\n\nThe announcement is coming at Hulu’s virtual NewFronts presentation for advertisers. The Disney-owned streaming service is pitching this as an extension of an ad strategy that tries to find new viewer-friendly ways to advertise, for example with ads designed specifically for pausing or brand-sponsored, ad-free “binge watch” episodes.\n\n“For our brand partners, the power of this ad experience lies in its ability to give viewers a simple way to engage with brands and take action on their mobile device,” said Laura Nelson, senior vice president for cross portfolio solutions at Disney Advertising Sales, in a statement. “Ultimately, this helps advertisers get closer to their conversion goals with Streaming TV.”\n\nHulu says it will also be integrating with Nielsen Media Impact to help advertisers measure the reach of their campaigns, and that it plans to launch something called Disney Hulu XP in October, which will give advertisers a way to buy video campaigns across Disney properties.\n\nAnd Hulu is using the presentation to highlight early data from a behavioral study of streaming audiences. It says streaming audiences tend to be younger, more affluent and more likely to be college educated than an average audience. It also says streaming audiences divide into streaming only (37%), streaming most (47%) and streaming also (16%) — and that three-quarters of streaming audiences want some degree of personalization from advertisers.", "url": "https://techcrunch.com/2020/06/22/hulu-announces-a-new-offer-focused-ad-format-called-gatewaygo/"},
{"title": "Apple adds a dedicated biking feature to Maps in iOS 14", "author": "Kirsten Korosec", "published_at": "2020-06-22 11:53:41", "content": "Apple’s  newest version of iOS is bringing a host of new features to Maps, including a dedicated cycling option that will optimize paths for bicyclists and even let users know if the route includes challenging hills.\n\nApple unveiled the new feature Monday at a virtual version of WWDC 2020, the company’s annual developer conference.\n\nApple Maps has included public transit and walking in previous iterations. But the biking option has been the most requested, according to Apple senior director Stacey Lysik.\n\nThe cycling feature will roll out in iOS 14 in a limited number of cities initially, starting with New York City, the San Francisco Bay Area, and Shanghai and Beijing in China. Apple will add many more cities in the coming months, Lysik said.\n\n“We’ve built an incredible cycling experience that helps you get around town on your bike,” Lysik said. \n\nThe biking option takes elevation into account to let users know if they‘re in for a challenging uphill workout or a leisurely flat ride. Lysik said users will also be able to tell it their route includes quiet or busy streets and even if there is a steep passage coming up or if they’ll need to carry their bike up the stairs. \n\nStairs is obviously not ideal, so this feature also lets users opt to avoid stairs altogether.", "url": "https://techcrunch.com/2020/06/22/apple-adds-a-dedicated-biking-feature-to-maps-in-ios-14/"},
{"title": "Horizon Quantum raises $3.23M for its quantum software development tools", "author": "Frederic Lardinois", "published_at": "2020-06-22 19:00:57", "content": "Horizon Quantum is part of a new crop of startups that focus on building new tools for building software for quantum computers. The Singapore-based company, which is hardware-agnostic but also launched a close partnership with Rigetti Computing in 2018, today announced that it has raised a $3.23 million funding round led by Sequoia Capital India. Previous investors SGInnovate, Abies Ventures, DCVC, Qubit Protocol, Summer Capital and Posa CV also participated.\n\nAt its core, Horizon Quantum aims to democratize quantum development. Because there is very little about quantum computing that is intuitive, the company argues, it will take a new set of tools to help today’s developers tackle quantum. What makes Horizon unique is that it takes conventional source code and then automatically analyzes that to figure out where a quantum computer could speed up an algorithm. Right now, the company can identify potential speedups in code written for Matlab and Octave.\n\n“The conventional approach to developing quantum applications is to explicitly specify the individual steps of a quantum algorithm, or to use a library where such explicit steps are specified. What makes our approach unique is that we construct quantum algorithms directly from conventional source code, automatically identifying places where it can be sped up,” explained Si-Hui Tan, the chief science officer at Horizon Quantum. “Everything that relates to quantum mechanics happens under-the-hood and on-the-fly in our compiler. This automation is what alleviates the need for any quantum knowledge. All our users have to do is to provide their program in a conventional programming language.”\n\nAt the same time, the company’s tools also make life for experienced quantum software developers easier by giving them the tools to write more succinct code that is also automatically optimized for the underlying quantum processors.\n\n“We’re building a compiler that can go all the way from conventional, classical, code down to the control signals sent to the quantum hardware,” Quantum Horizon CEO Joe Fitzsimons told me in an email. “We’re still building, and we have a lot still to do, but we’ve demonstrated key parts of the technology, from identifying speedups in classical code down to characterising and mitigating errors in quantum processors. Our hope is that it will make quantum computing more easily accessible for the millions of software developers out there, and will allow us to leverage quantum computing in new domains (we specifically think about domains like geophysics for the energy sector and computational fluid dynamics for aerospace and automotive sectors).”\n\nThe company says it will use the new funding to help bring its technology to market and engage with its early customers.", "url": "https://techcrunch.com/2020/06/22/horizon-quantum-raises-3-23m-for-its-quantum/"},
{"title": "Apple Maps gets electric vehicle routing to find EV chargers", "author": "Kirsten Korosec", "published_at": "2020-06-22 12:32:43", "content": "Apple  has added a routing feature to Maps that’s designed for electric vehicle owners. The EV routing feature, which will be available in the newest version of iOS, is one of several improvements that Apple is making to Maps.\n\nApple unveiled the new feature Monday at a virtual version of WWDC 2020, the company’s annual developer conference.\n\nThe EV routing aims to eliminate range anxiety — the fear of running out of charge — by showing charging stations compatible to a user’s electric vehicle along their route. Maps on iOS 14 will track the user’s current charge and factor in things like elevation and whether to automatically add charging stops along their route, Apple senior director Stacey Lysik said Monday during WWDC 2020.\n\nApple said it’s working with a number of manufacturers to support easy routing in their vehicles, including BMW and Ford. Lysik said more manufacturers will be added in the near future. Ford confirmed it is working with Apple and didn’t provide any further details. \n\nApple Maps is also adding a feature that lets users view congestion and green zones and pick alternate routes that avoid these areas, if needed. Drivers in China will also be able to securely store their license plate number on their iPhone, so they can more easily keep track of which days they can enter congested city centers, based on that number. Per policy in China, drivers can only enter into congestion zones on particular days. ", "url": "https://techcrunch.com/2020/06/22/apple-maps-gets-electric-vehicle-routing-to-find-ev-chargers/"},
{"title": "Here’s how Apple’s stock fared during the WWDC keynote", "author": "Alex Wilhelm", "published_at": "2020-06-22 12:27:36", "content": "Apple  held its WWDC keynote today, a virtual affair that managed to convince swaths of the technology industry to watch a pre-recorded video.\n\nWhile TechCrunch has posts galore up on the site about all the latest stuff from Cupertino, we also kept an eye on Apple’s stock price during its event. Doing so is a TechCrunch tradition, even if the company’s shares don’t tend to trade too sharply during its events.\n\nApple has the ability to rock other boats, however, as we learned during its 2018 hardware event that kneecapped the value of Fitbit after the Apple Watch Series 4 was announced. So, consider this short entry a look at Apple’s own share performance, and whomever else got swept up in its wake.\n\nThe WWDC keynote just wrapped, so here’s the full share-price result from the long-form video presentation:\n\nIf you don’t know what to make of that, don’t worry, we understand. In fact, in preparation for that chart being somewhat hard to parse, we’ve prepared a per-announcement rundown of what Apple just shared, and what the news did for its investors.\n\nSo, in honor of the venerable tradition of live blogging Apple events, TechCrunch presents you with a world-first Apple keynote stock market live blog blog post. Let’s go:\n\nAnd that’s that.\n\nWe made this long, tedious joke about how Apple announcements don’t move its share price for two reasons. First, investors obviously have no idea what any of the company’s announcements mean. And, second, because that fact mocks fans of the efficient market theory. Investors big and small now have loads more information than they did, and, in their view, Apple’s shares are worth precisely what they were before. Huzzah.\n\nYou can catch up on all the Apple news here.", "url": "https://techcrunch.com/2020/06/22/heres-how-apples-stock-fared-during-the-wwdc-keynote/"},
{"title": "Facebook acquires VR studio behind ‘Lone Echo’", "author": "Lucas Matney", "published_at": "2020-06-22 13:15:11", "content": "Facebook has been on a game studio acquisition spree over the past year, buying up developers behind some of the most popular VR titles.\n\nThat trend continued today with the company’s acquisition of Ready at Dawn Studios, the developer behind the Lone Echo games, one of Oculus’s most successful series. The studio has been working closely with Facebook and Oculus for a while as a publishing partner, this acquisition brings the team into the Oculus fold as they prep the release of a full sequel to Lone Echo. Facebook notably did not give any updates on the status of Lone Echo II, which has had its launch repeatedly delayed after initially announcing a 2019 launch date. The title is expected to be released sometime this year.\n\nDeal terms weren’t disclosed though Facebook says they are bringing the entire team onboard. The studio will operate independently out of their Irvine, California and Portland, Oregon offices.\n\nLone Echo has been renowned as one of the more finessed and innovative VR titles, with both single and multi-player iterations ranking high among VR users. The series has also been embraced in the eSports world, which hasn’t always been receptive to virtual reality games. Before fully embracing VR, Ready at Dawn was developing console titles including several licensed games in the God of War series.\n\nFacebook previously announced the acquisition of Beat Games, the studio behind Beat Saber, and Sanzaru Games, the developer behind the Rift game Asgard’s Wrath. Facebook’s acquisition strategy gives some of the more visible VR studios greater breathing room to continue investing in upcoming VR titles without getting overwhelmed by staying afloat.\n\nAdvances in the VR space have been slow-moving and though VR developers have seen some usage bumps from shelter-in-place, a general lack of hardware availability has left a ceiling on growth numbers. As other VR hardware makers seem to slowly pull back on the space and other immersive platforms like Magic Leap exit the consumer arena, life is becoming even more difficult for VR developers looking to create high-quality titles.", "url": "https://techcrunch.com/2020/06/22/facebook-acquires-vr-studio-behind-lone-echo/"},
{"title": "Apple’s iMessage update takes cues from Slack with mentions, pins, threads and more", "author": "Sarah Perez", "published_at": "2020-06-22 12:34:59", "content": "Apple’s iMessage platform is getting a notable update with the release of iOS 14 and macOS’s Big Sur. At its virtual Worldwide Developer Conference keynote this morning, Apple announced the next version of iMessage will support a number of popular features found in rival messaging apps like Slack or even Facebook’s Messenger, among others. This includes added support for common features like inline replies, pins, and mentions, plus updated customizations for group chats, expanded Memoji, improved search, and more.\n\nWith the new inline replies feature, iMessage users in a group chat will be able to respond to specific messages using threads — a feature common to a number of other top messaging apps, including Slack. With inline replies, users can opt to view the replies within the full conversation, or you can opt to view them as their own thread.\n\nTo make it easier for other iMessage users to know who a message was meant for in a group chat, iMessage is adding support for Mentions. But unlike the @ mention format on some apps and social platforms, like Twitter, iMessage only requires you type someone’s name — no extra symbol required.\n\nThe app will pop up a contact suggestion, which you can then click to select. The person’s name is then highlighted in blue in your text to indicate you’ve directed your comment to them.\n\nThe best part, however, is that you’ll be able to configure the Messages app to only notify you when you’ve been directly mentioned in a conversation. That will help you better keep up with busier chats you may have set on mute, without missing anything important.\n\nThe design for Group chats has also changed, where now the profile icons for the most recently active people are shown the largest.\n\nGroup chats can also be customized with a personal photo or emoji as their main photo. Within the conversation, you’ll see the group members’ profile icons spread out around this main image.\n\nAnother new feature, Pinned Conversations, will allow you to keep your most important iMessage chats at the top of the screen. This way, you can more easily jump back into your most frequently accessed conversations, like your BFF or family group chat, for example. But it also gives you a way to quickly continue a conversation with an important contact, like a significant other, spouse, or child, or anyone else you message often.\n\nAs new messages arrives in these group chats, they’ll display right at the top of the screen. You can even see the typing indicator appear when someone is texting you.\n\nThis feature will be particularly useful for those who primarily and regularly use iMessage to keep track of their conversations, but often miss important messages in a long list of unreads. It also gives you an easy way to reduce screen time, by giving you a single place to quickly make sure you haven’t missed an urgent message, without having to scroll through your list of unreads and catch up.\n\nIn addition, Apple is updating its Memoji with 20 new hair and headwear styles, face coverings, and more age options, plus 3 new Memoji stickers (hug, fist bump, and blush).\n\nOn Mac, the Messages app will also gain access to the new features including Inline Replies, Pinned Conversations, and Mentions, as well as iMessage’s Message Effects, the ability to customize Memoji, a new photo picker and #images. Apple promises also a revamped Search experience which better organizes results into links, photos, and matching items.\n\nThe new features will roll out with the release of iOS 14 and macOS Big Sur later this year.", "url": "https://techcrunch.com/2020/06/22/apples-imessage-update-takes-cues-from-slack-with-mentions-pins-threads-and-more/"},
{"title": "Apple unveils iOS 14 and macOS Big Sur features for India, China and other international markets", "author": "Manish Singh", "published_at": "2020-06-22 12:53:35", "content": "Apple  will roll out a range of new features and improvements that are aimed at users in India, China and other international markets with its yearly updates to iOS, iPadOS, and macOS operating systems, it unveiled today.\n\niOS 14, which is rolling out to developers today and will reach general users later this year, introduces new bilingual dictionaries to support French and German; Indonesia and English; Japanese and Simplified Chinese; and Polish and English. For its users in China, one of Apple’s biggest overseas markets, the iPhone-maker said the new operating system will introduce support for Wubi keyboard.\n\nFor users in India, Apple is adding 20 new document fonts and upgrading 18 existing fonts with “more weights and italics” to give people greater choices. For those living in the world’s second largest internet market, Mail app now supports email addresses in Indian script.\n\nApple said it will also deliver a range of additional features for India, building on the big momentum it kickstarted last year.\n\nMessages  now feature corresponding full-screen effects when users send greetings such as “Happy Holi” in one of the 23 Indian local languages.\n\nMore interestingly, iOS 14 will include smart downloads, which will allow users in India to download Indian Siri  voices and software updates as well as download and stream Apple TV+ shows over cellular networks — a feature that is not available elsewhere in the world.\n\nThe feature further addresses the patchy networks that are prevalent in India — despite major improvements in recent years. Last year, Apple beamed a feature for users in India that enabled users in the nation to set an optimized time of the day in on-demand streaming apps such as Hotstar and Netflix for downloading videos.\n\nNew improvements further shows Apple’s growing focus on India, the world’s second largest smartphone market. Apple chief executive Tim Cook said earlier this year that the company will launch its online store in the country later this year, and open its first physical store next year. A source familiar with the matter told TechCrunch last month that the global pandemic had not affected the plan.\n\niOS 14 will also allow users in Ireland and Norway to utilize the autocorrection feature as the new update adds support for Irish Gaelic and Norwegian Nynorsk. And there’s also a redesigned Kana keyboard for Japan, which will enable users there to type numbers with repeated digits more easily on the redesigned Numbers and Symbols plane.\n\nAll the aforementioned features — except email addresses in Indian script in Mail and smart downloads for users in India — will also ship with iPadOS 14. And the aforementioned new bilingual dictionaries, new fonts for India, and localized messages are coming to macOS Big Sur.\n\nAdditionally, Apple says on the desktop operating system it has also enhanced predictive input for Chinese and Japanese results in more accurate and contextual predictions.", "url": "https://techcrunch.com/2020/06/22/apple-unveils-ios-14-and-macos-big-sur-features-for-india-china-and-other-international-markets/"},
{"title": "President Trump signs executive order temporarily suspending work visas for H-1B holders", "author": "Jonathan Shieber", "published_at": "2020-06-22 14:11:27", "content": "President Donald Trump signed an executive order temporarily halting work visas like the H-1B visa program for highly-skilled workers, cutting off a critical source of foreign labor for tech companies already complaining about tech talent shortages.\n\nVisa-holders already in the U.S. and those applicants who have already received a visa are exempt from the ban. The restrictions are intended to last until the end of the year, which would disrupt the government’s typical process of awarding new visas at the beginning of the national fiscal calendar in October.\n\nOfficials from the Trump administration told the Wall Street Journal that the move is intended to protect American jobs, but executives in the technology industry have long warned that visa restrictions would hurt the nation’s ability to compete in industries that have both strategic and financial significance as engines of economic growth.\n\nTech officials have even cited immigration curbs as a factor that would force companies to relocate more of their operations overseas in an effort to hire and retain top technology talent.\n\nAccording to news reports, officials expect these new restrictions to last until the end of the year, and expand the immigration bans that the President put in place in April that blocked family members of U.S. citizens from immigrating and slashed the number of visas available to high-skilled  workers looking to immigrate to the US.\n\nEstimates provided to the Wall Street Journal indicate that roughly 525,000 people will be unable to enter the country as a result of the expanded travel restrictions including 170,000 green card holders barred from entering the U.S. since April. The Trump administration official quoted by the Journal called the initiative an “America-first recovery” that would potentially open up 500,000 jobs for out-of-work Americans.\n\nTechnology executives are already voicing their displeasure with the reported ban. “Banning all H1B [sic] visas means CEOs like me have to open offices and hire more people in countries like Canada  that allow immigration. This visa ban is morally wrong and economically stupid,” wrote Anshu Sharma,  the chief executive officer of the technology startup Skyflow.\n\nInvestors are also up-in-arms about the decision’s impact on America’s ability to compete.\n\n“Whether his administration realizes it or not, they creating a significant handicap for US innovation. Our most innovative and impactful portfolio companies and many of their employees started as H-1b holders,” wrote Stonly Baptiste, the co-founder of technology investment fund, Urban.us. “We literally couldn’t have built our portfolio in an environment without H-1B. And we’re not even an immigrant focused fund.”\n\nAlso on the chopping block are H-2B visas, which are used to let short-term seasonal workers in landscaping and non-farm jobs into the country, J-1 jobs for short-term workers like camp counselors and au pairs and L-1 visas for corporate company transfers.\n\n“By limiting the talent pool for American companies, the US government is hindering our ability to build strong, defensible organizations,” wrote Andy Coravos, the chief executive officer of the healthcare-focused startup Elektra Labs, in a direct message. “The Trump Administration’s Executive Order to suspend foreign work visas is not only based in fear, but also perpetuates fear within our community, and is not in our society’s best interest.”\n\nHealthcare workers, coronavirus researchers, food supply workers in food packaging are all exempt from the visa suspensions.\n\nTechnology executives aren’t the only ones coming out against the tighter immigration rules. A group of nine Republican senators including South Carolina’s powerful senior senator, Lindsey Graham, and Texas Senator John Cornyn, issued a joint letter on May 27, which pleaded with the President to reconsider the rumored immigration restrictions.\n\n“Guest workers are needed to boost American business, not take American jobs,” they wrote.\n\nUpdate June 22: Linked to the published Executive Order.", "url": "https://techcrunch.com/2020/06/22/president-trump-reportedly-will-sign-executive-order-temporarily-suspending-work-visas-for-h-1b-holders/"},
{"title": "Google employees demand company stop selling tech to police", "author": "Megan Rose Dickey", "published_at": "2020-06-22 15:17:25", "content": "A growing group of more than 1,666 Google  employees is demanding Google stop selling its technology to police departments, TechCrunch has learned.\n\n“We’re disappointed to know that Google is still selling to police forces, and advertises its connection with police forces as somehow progressive, and seeks more expansive sales rather than severing ties with police and joining the millions who want to defang and defund these institutions,” employees wrote in a letter to Alphabet CEO Sundar Pichai. “Why help the institutions responsible for the knee on George Floyd’s neck to be more effective organizationally? Not only that, but the same Clarkstown police force being advertised by Google as a success story has been sued multiple times for illegal surveillance of Black Lives Matter organizers.”\n\nGoogle, for example, has publicized how Clarkstown Police Department uses G Suite for sharing information and digital evidence. Meanwhile, Google is also a partner and donor to the Seattle police foundation and its venture capital arm, GV, has invested in startups working on artificial intelligence technology for police.\n\n“We’re committed to work that makes a meaningful difference to combat systemic racism, and our employees have made over 500 product suggestions in recent weeks, which we are reviewing,” a Google spokesperson told TechCrunch. “On this one, we were the first major company to decide, years ago, to not make facial recognition commercially available and we have very clear AI Principles that prohibit its use or sale for surveillance. We have longstanding terms of use for generally available computing platforms like Gmail, GSuite and Google Cloud Platform, and these products will remain available for Governments and local authorities, including police departments, to use.”\n\nIn the letter, employees go on to say they want to be proud of the company they work for. They also want Google to speak to their values, the letter says.\n\n“The racist legacy of police across the United States goes all the way back to its roots, when police forces emerged to protect the wealth gotten from slavery and genocide,” the letter states. “We have a long way to go to address the full legacy of racism but to begin with — we should not be in the business of profiting from racist policing. We should not be in the business of criminalizing Black existence while we chant that Black Lives Matter. We, the undersigned Googlers, call on you to stop making our technology available to police forces.” \n\nGoogle employees have been able to successfully pressure the company to drop contracts in the past. After employees petitioned Google to stop working on Project Maven, Google decided not to renew its contract with the Pentagon for that project. Then, in October 2018, Google dropped out of the running for JEDI, the big cloud computing contract with the Pentagon.\n\nGoogle is not the only tech company that has contracted with police departments and other law enforcement agencies. Salesforce, for example, has long held a contract with Customs and Border Protection, despite protest from employees and others.\n\nSome positive change, however, has occurred. Earlier this month, IBM said it would no longer sell its facial recognition technology, which has become a tool for policing and mass surveillance. Meanwhile, Microsoft recently said it won’t sell facial recognition technology to police without federal regulation and Amazon halted police use of its facial recognition tech for one year. These were direct responses to the police killing of George Floyd, an unarmed Black man.\n\nIn response to Floyd’s death, Pichai noted in an email to employees that “Our Black community is hurting, and many of us are searching for ways to stand up for what we believe, and reach out to people we love to show solidarity.”\n\nHe also outlined how Google will give $12 million to racial justice organizations. Since then, Pichai has elaborated on Google’s commitments to racial justice. Internally, for example, Google committed to improving diverse representation at the leadership level by 30% by 2025.\n\n“We want Google to take real steps to help dismantle racism,” employees wrote. “We as a society have moved past the point where saying Black Lives Matter is enough, we need to show it in our thinking, in our words and in our actions that Black lives do matter to us.”", "url": "https://techcrunch.com/2020/06/22/google-employees-demand-company-stop-selling-tech-to-police/"},
{"title": "Apple will soon let developers challenge App Store rules", "author": "Devin Coldewey", "published_at": "2020-06-22 17:30:39", "content": "Apple  has announced an upcoming change to App Store rules that could mark a major shift in how the marketplace operates. Developers will soon be able to challenge not just the rejection of an app, but the rule that prompted that rejection. Bug fixes will also no longer be held up by rule violations.\n\nIn a blog post about changes for apps and developers, Apple noted these major additions with remarkably little fanfare:\n\nApp Store rules have been in the headlines this week due to a fracas over monetization that saw the new email service Hey rejected from the platform over a reluctance to share its subscription revenue with Apple.\n\nWhile the issue is hardly new and it seems unlikely that a high-profile play like Hey (from Basecamp co-founder David Heinemeier Hansson) was unaware that this would happen, this isn’t the first criticism of Apple’s one-size-fits-all business model for apps.\n\nIn an interview with TechCrunch, Apple’s Phil Schiller said the company was not considering any changes to the rules that would allow Hey — and other apps with similar models — to operate on the App Store without surrendering a significant cut of its income.\n\nBut while Apple may not be considering changing the rules immediately, it seems from today’s announcement that the rules may change eventually. Exactly how feedback from developers would be solicited, processed, and weighed is not addressed, but we can probably expect to hear more during this week’s many developer sessions (and during which suggestions will no doubt begin to be submitted).\n\nThe second change takes a bit of the pressure off app developers that may find themselves, as Hey did, blocked from providing security updates because of business concerns. Separating the two seems only right, since Apple doesn’t want its users at risk because negotiations haven’t concluded. It shrinks the size of the stick that Apple wields against recalcitrant developers, but ultimately results in less risk for everyone involved.\n\nThe changes to App Store rules will be arriving this summer, and more details will surely be forthcoming before then.", "url": "https://techcrunch.com/2020/06/22/apple-will-soon-let-developers-challenge-app-store-rules/"},
{"title": "Big outdoor brands join #StopHateForProfit campaign, boycott Facebook and Instagram ads", "author": "Taylor Hatmaker", "published_at": "2020-06-22 13:09:07", "content": "As corporations fall over themselves to perform their mostly abrupt commitments to racial justice, a few companies are seizing the moment to call out Facebook  for its own failings.\n\nA handful of the biggest names in outdoor gear have suspended ads across Facebook and Instagram  for the month of July as part of #StopHateforProfit, an accountability campaign demanding a set of changes from Facebook around racism, misinformation and other harmful content on its platform.\n\nOutdoor retail giants REI and The North Face announced their participation on Friday, with Patagonia joining over the weekend. The campaign issued a set of actionable demands for the company, calling for Facebook to stop collecting ad revenue from “misinformation and harmful content,” demanding more resources for users targeted by racism and other forms of hate and asking the company to provide moderators for private groups.\n\nThe campaign was coordinated by the Anti-Defamation League, the NAACP, Color of Change, Free Press and Sleeping Giants, an organization behind many successful ad boycott pressure campaigns in recent years.\n\n“We are asking all businesses to stand in solidarity with our most deeply held American values of freedom, equality and justice and not advertise on Facebook’s services in July,” the campaign’s website states.\n\n“… Let’s send Facebook a powerful message: Your profits will never be worth promoting hate, bigotry, racism, antisemitism and violence.”\n\nFacebook has come under frequent scrutiny in recent years for its failure to eradicate misinformation and hateful content. As TechCrunch previously reported, white supremacist content flourished on the platform, and Facebook and Instagram only moved to ban white nationalism and white separatism one year ago.\n\nFacebook has also signaled its reluctance to take action against President Trump, who has frequently shared misinformation intended to discourage voters in recent weeks. In a surprising turn for a company that usually keeps internal dissent quiet, Facebook employees openly criticized their employer’s decision to take no action on a violent threat from the president against protesters in the days following George Floyd’s killing.\n\nThe threat, which warned “When the looting starts, the shooting starts” echoed racist threats by authorities made during the civil rights movement. Twitter’s decision to attach fact-checking labels or hide some of the president’s tweets at the time served to further highlight Facebook’s own reluctance to moderate its platform.\n\nOn the #StopHateforProfit website, the campaign explains the reasoning behind targeting Facebook for the boycott:\n\nAs media, tech and other businesses face long overdue reckonings around racism, the outdoor community is undergoing its own self-examination. Even as companies like REI and a growing handful of independent initiatives make efforts to highlight a diverse community beyond the straight white men who have long dominated the image of the outdoors, the adventure community must grapple with its reputation for toxicity and being hostile to change.\n\nIf change is difficult in the outdoor industry, forcing a tech platform with unprecedented resources and power to change is more akin to moving a mountain. Facebook faces regular criticism from the press and its users, but high profile efforts by brands forgoing ads on its platforms are something new. If they’ll build more momentum or last beyond the month isn’t clear, but we’ll be watching to see where the effort goes—and if Facebook considers making any of the reasonable changes its critics are demanding.", "url": "https://techcrunch.com/2020/06/22/facebook-instagram-rei-patagonia-north-face-brands-join-stophateforprofit-boycott/"},
{"title": "Apple will let you emulate old apps and run iOS apps on ARM Macs", "author": "Romain Dillet", "published_at": "2020-06-22 12:01:29", "content": "Apple  has announced a major shift for the Mac. In the future, the company is going to switch from Intel CPU to Apple’s own silicon, based on ARM architecture. If you are a developer or if you run obscure enterprise apps, you may have a lot of questions about how it’s going to work.\n\nFirst, you’ll be able to compile your app to run both on Intel-based Macs and ARM-based Macs. You can ship those apps with both executables using a new format called Universal 2. If you’ve been using a Mac for a while, you know that Apple used the same process when it switched from PowerPC CPUs to Intel CPUs — one app, two executables.\n\nAs for unoptimized software, you’ll still be able to run those apps. But its performances won’t be as good as what you’d get from a native ARM-ready app. Apple is going to ship Rosetta 2, an emulation layer that lets you run old apps on new Macs.\n\nWhen you install an old app, your Mac will examine the app and try to optimize it for your ARM processor. This way, there will be some level of optimization even before you open the app.\n\nBut what if it’s a web browser or a complicated app with just-in-time code? Rosetta 2 can also translate instructions from x86 to ARM on the fly, while you’re running the app.\n\nAnd if you’re a developer working on code that is going to run on servers, Apple is also working on a set of virtualization tools. You’ll be able to run Linux and Docker on an ARM Mac.\n\nAs a bonus, users will also be able to access a much larger library of apps. “Mac users can for the first time run iOS and iPadOS apps on the Mac,” Apple CEO Tim Cook said.\n\nWhile the company didn’t share a lot of details, Apple isn’t talking about Catalyst, its own framework that makes it easier to port iOS apps to macOS. You should be able to download and run apps even if the developer never optimized those apps for macOS.\n\nThe transition is going to take a while — around two years. The first ARM-based Mac will ship by the end of the year. There will be a quick start program for developers interested in porting apps to ARM-based Macs. In addition to documentation and a private forum, Apple will send you a custom-made Mac Mini with an A12Z system on a chip. This way, you can test your apps on an actual Mac with an ARM chip.", "url": "https://techcrunch.com/2020/06/22/apple-will-let-you-emulate-old-apps-and-run-ios-apps-on-arm-macs/"},
{"title": "Microsoft kills Mixer, will push users to Facebook Gaming", "author": "Lucas Matney", "published_at": "2020-06-22 11:47:32", "content": "Microsoft  is killing its Twitch competitor Mixer next month and is partnering with Facebook to push its users toward the Facebook Gaming service.\n\nThe app is winding down on July 22. The sudden move comes after Microsoft has dumped considerable efforts into its gaming-centric streaming service, acquiring streaming rights to some of the biggest esports personalities like Ninja and Shroud. Microsoft couldn’t spend its way into meaningfully competition with Amazon’s Twitch and Alphabet’s YouTube Gaming.\n\nThe company launched its Mixer service in 2017 after acquiring the gaming startup Beam Interactive in 2016.\n\nMicrosoft announced that when the service sunsets, it will be transitioning partnerships to Facebook Gaming and redirecting its users to the service as well. The partnership between the two is a T-Mobile and Sprint partnership of sorts, as the two were clearly trailing far behind the YouTube Gaming/Twitch duopoly. The Facebook partnership goes deeper than just watching streams; Microsoft will integrate their xCloud game-streaming service into Facebook Gaming so users can quickly play titles that they see inside the service.\n\nAccording to an interview in The Verge, top streamers like Ninja won’t be forced to migrate to Facebook Gaming and will be able to rejoin Twitch if they choose. Microsoft’s gaming chief Phil Spencer pinned the shutdown on the service’s inability to catch up with competitors:\n\nAccording to data from SensorTower, year-to-date downloads of the app on the App Store and Google Play were down 23% in 2020 compared to the same period of 2019, with the app seeing 3.4 million downloads this year. The company says their data shows that the app has been installed about 21 million times in total.\n\nThe announcement came in the midst of Apple’s WWDC keynote, so fair to say that Microsoft was likely aiming to minimize attention on this high-profile shutdown.", "url": "https://techcrunch.com/2020/06/22/microsoft-kills-mixer-its-twitch-competitor/"},
{"title": "Capsule’s video Q&A platform helps brands reach their community in the post-COVID era", "author": "Sarah Perez", "published_at": "2020-06-22 09:33:05", "content": "A new startup called Capsule has launched a new way for brands to create original video content with their community in the form of Q&As. But unlike a simple Instagram story’s Q&A session, Capsule provides a full platform for designing the Q&A session, branding the content, curating the responses from users and tracking the resulting data. But the most notable feature is Capsule’s automated editing process that adds branding, effects and music to the final product, allowing brands to skip the post-production process and more quickly publish their video.\n\nThe product comes from the same team behind the animated GIF capture tool and social network Phhhoto, which eventually lost out to Instagram’s clone, Boomerang. Following Phhhoto’s shutdown in late 2017, the team pivoted to an experiential marketing business, Hypno, that provided photo booths, plus other camera platforms and interactive experiences, for live events, retail and attractions.\n\nThe idea for the new startup directly emerged from the challenges now facing Hypno in the face of the COVID-19 pandemic.\n\n“Capsule was born out of the need for some of our events and live experiences customers to figure out a way to activate their audiences because they couldn’t do it in real life,” explains co-founder Champ Bennett. “The Hypno business pretty much dried up in terms of its opportunities as soon as the pandemic hit,” he says.\n\nThe team refocused its efforts on the new software platform instead, and received an immediate, overwhelming response from its existing customers. It also quickly added new ones — including those outside the live events space.\n\nIn the two months following its MVP launch, Capsule has been generating revenue from its now 35,000 users, including some big-name customers like Netflix, Samsung, Chicago Bulls and a handful of colleges and universities that wanted to create solutions for virtual graduations. Consumers, meanwhile, have also used the product for virtual birthdays, weddings and baby showers.\n\nThe platform itself works something like a Squarespace for the video Q&A format.\n\nTo use Capsule, the brand will first pick a template that it can customize to match its current campaign by changing the logos, colors, buttons, backgrounds and URLs.\n\nThey then choose their own questions and prompts designed to get their customers/users/community members talking.\n\nTo respond, users visit the Capsule URL — which can be a custom domain for an extra fee — to record and upload videos via their phone or laptop. These videos can only be a max of 60 seconds in length to keep the content short and snappy.\n\nBrands can curate the responses they want to use in the resulting product, aka the “capsule.” They’ll also have access to the raw video footage for use elsewhere on social media, if needed.\n\nCapsule’s best trick is that it instantly and automatically processes the video, adding music, lower-third graphics and a preroll and a post-roll, so the video looks professionally edited.\n\n“It makes everybody look a little better than what they would normally look like if they were just recording right from their phone — which generally looks pretty raw and unedited,” explains Bennett. “That editing feature is the magic of that whole thing, as it makes it feel really special.”\n\nThe automated editing involves a scripting language the Capsule team created, which includes a set of instructions on how to process a given video. Capsule’s customers simply select the “type” of video they want, and Capsule does the rest.\n\n“One might be really energetic, with flashing graphics and pumping music. And one might be a little bit more somber and may have an acoustic guitar playing behind it,” Bennett notes. “Ultimately, what will happen is when you create a Capsule, you’ll be able to pick that that feel.”\n\nRight now, Capsule offers 10 of these “templates,” but is working to have around 50 available within the next couple of months.\n\nDepending on the type of solution a brand needs, Capsule’s service can cost anywhere from $10 per month to as much as $20,000 per year. It currently works via the web and mobile web, but Capsule is developing an iPhone app that will allow the capture of higher-quality video.\n\nWhile the original focus was to create a new engagement platform for brands that have lost the ability to host live events, the range of post-COVID use cases is continuing to grow. Netflix, for example, ran a focus group using Capsule to ask questions and get video, instead of written responses from viewers. Will Ferrell used Capsule to leave a video message for graduates. Media company OkayAfrica’s community used Capsule to talk about the impacts of the COVID-19 crisis, organized in thematic sections.\n\nBennett says the company is also thinking about how Capsule can be used to provide a platform for people’s voices who may not otherwise be heard.\n\nFollowing its launch, it’s clear Capsule became a more flexible format than perhaps originally envisioned. But to what extent customers’ usage will change over time remains less certain. If a coronavirus vaccine is developed, for example, the need for video to stand in for live events may not be as in demand as it is now, for example. Of course, no one knows when that time will come at this point.\n\nIn addition to Bennett, Capsule’s co-founders include Russell Armand and Joseph Jorgensen, also of Phhhoto and Hypno. The company is planning to spin out Capsule from Hypno and is already receiving inbound interest from investors. Capsule has not closed a seed round at this time.", "url": "https://techcrunch.com/2020/06/22/capsules-video-qa-platform-helps-brands-reach-their-community-in-the-post-covid-era/"},
{"title": "Here’s everything Apple announced in the WWDC 2020 keynote today", "author": "Greg Kumparak", "published_at": "2020-06-22 12:18:58", "content": "Today marks the first day of Apple’s  Worldwide Developer Conference (or WWDC, as it’s known.) With the pandemic continuing to rage on throughout the world, this year’s WWDC is entirely virtual — including the company’s big annual keynote, where it shows off all of the updates coming to iOS, macOS, and all of the other software it builds in-house.\n\nDidn’t have time to watch the whole stream live? Here’s a quick rundown of all the highlights, category-by-category.\n\nThe next version of iOS will roll out in preview mode to developers today, with a public beta expected sometime in July.\n\nThe next build of macOS will be called “Big Sur”, and will include some tweaks that’ll make it look and feel a bit more like iOS (like rounded square icons across the built-in App suite.)\n\nAs rumored for months, Apple is switching from Intel to custom ARM-based CPUs it’s designing in-house, as it’s done for years across its iPhone/iPad/Watch lineups. The company says that this will bring a “whole new level of performance” while consuming less power, and allow for things like Apple’s Secure Enclave to come to the Mac. And iOS apps will be able to run on the Mac!\n\nWhile developers will need to update their applications to run natively on the new chipsets, Apple says most developers should be able to get things “running in just a matter of days”; meanwhile, “Rosetta 2” in Big Sur will automatically/transparently translate existing apps for compatibility.", "url": "https://techcrunch.com/2020/06/22/heres-everything-apple-announced-in-the-wwdc-2020-keynote-today/"},
{"title": "Apple unveils iOS 14 with home screen widgets", "author": "Romain Dillet", "published_at": "2020-06-22 10:28:13", "content": "During the virtual keynote of WWDC, Apple shared the first details about iOS 14, the next major version of iOS that is going to be released later this year. The most visual change is that the home screen is getting widgets.\n\n“This year, we spent time rethinking the iconic experience of the iPhone,” SVP of Software Engineering Craig Federighi said. “We’ve rethought some of the core elements of iOS.”\n\nAs you know, iOS already comes with widgets in the Today view — swipe left on the home screen to access widgets. Widgets have been completely redesigned. Some of them take the full width of the device, others can be limited to a small square. You can now have two columns of widgets.\n\nBut widgets are no longer limited to the Today view. You can drag them out of the Today view and drop them on your home screen. There’s also a new widget gallery that lets you add widgets when you’re moving icons around on the home screen.\n\nAs for home screen organization, Apple knows that a lot of people have an endless list of icons, making the home screen harder to use. Apple is adding some smart organization features.\n\n“Today’s home screen is great but as we get more apps we end up with this — lots and lots of pages,” Federighi said.\n\nAt the end of the home screen pages, there’s a new page called the App Library. All the apps that aren’t on your home screen are sorted in automatic categories, such as Apple Arcade.\n\nThe other feature that is going to have an impact on multitasking and the home screen is that you can use picture in picture on the iPhone just like on the iPad. You can keep a video in a corner of the screen and do something else on your phone.\n\nMessages is getting a much-needed update to compete with WhatsApp, Telegram and other popular messaging apps. You can now pin conversations at the top to access them more easily.\n\nConversations themselves are getting an upgrade as you can reply to individual messages. You can then tap on the reply to see the conversation as a separate thread. People can mention you and you can filter your notifications to mentions only.\n\nEach conversation is now more customizable. You can set a photo or an emoji for a conversation. Apple also shows the icons of your contacts in a specific conversation. The most active people get a bigger icon.\n\nMemoji is getting some new options, such as new hair options, new age options and face covers. There are new Memoji stickers as well, such as a hug sticker, a fist bump sticker and a blushing sticker.\n\nApple is also adding new features to Maps. While the U.S. has received updated data, Apple is going to roll out better maps in other countries, based on its own data set. Up next, the U.K., Ireland and Canada will get much more detailed maps. And this is just the first step as the new data set opens up more possibilities.\n\n“In iOS 14, the Maps team will be working with some of the most trusted brands to bring you guides,” Meg Frost, director Product Design of Apple Maps, said. You’ll soon be able to browse information from AllTrails, Zagat and more sources.\n\nIn some cities, Apple is going to roll out cycling as a transportation mode. It’ll take into consideration elevation. Cycling will be available in New York City, Los Angeles, San Francisco, Shanghai and Beijing at first. For walking directions, you can now say to avoid steps and steep hills.\n\nFor drivers, there will be more features as well, such as EV routing and more information about restricted city centers. And if your car supports CarPlay, there will be more types of apps in the future, such as parking apps, EV charging apps and food-ordering apps.\n\nCar manufacturers will also be able to let you use your iPhone as a car key. It leverages the U1 chip on the most recent iPhone models. Interestingly, you’ll be able to share your key with a friend by sending it over iMessage.\n\nWhile Siri can be hit or miss, Apple is still iterating on the voice assistant. Siri will no longer take over the entire screen when you trigger it. It’ll be a small bubble at the bottom of the screen, which doesn’t obstruct the rest of the screen. Results appear at the top of the screen and appear like a notification.\n\nYou can now ask Siri to send audio messages using iMessage. And if you hate audio messages like me, keyboard dictation has been improved. Your voice is now processed on device, which should help when it comes to speed.\n\nSiri lets you translate words already, but Apple is going one step further by releasing a Translate app. Like Google Translate, you can have a conversation in two different languages. You can translate from voice-to-text-to-voice. If you rotate your iPhone in landscape mode, each person has one side of the screen.\n\nYou know that feeling. When your friends ask you to download another app, you don’t want to open the App Store. That’s why Apple is launching App Clips. They are sort of mini apps that you can launch without installing an app. It’s a small part of an app that you can easily share.\n\nThere are many ways to share App Clips. You can launch those apps from the web, from Messages, from Maps, from NFC tags or from QR codes. Get ready to see stickers at cafés, on scooters or in museums. Scan a code or tap your phone on it and you get an app-like experience. If you want to dive deeper, you can download the full app from the App Library.\n\nApple is adding a slew of new privacy-centric features. For instance, there’ll be a new dot in the top-right corner to indicate that an app is using or has recently used your microphone or camera. There will be new privacy cards in the App Store description pages to tell you how your data is used before you download an app. Apps will also have to ask before they track you across other apps and websites.\n\nAs always, iOS 14 will be tested over the summer and should be available to everyone in September.", "url": "https://techcrunch.com/2020/06/22/apple-unveils-ios-14-with-home-screen-widgets/"},
{"title": "To create the jobs our economy needs, the US must expand immigration", "author": "Sophie Alcorn", "published_at": "2020-06-22 09:34:20", "content": "As a second-generation immigration attorney, I’ve spent three decades helping people navigate the U.S. immigration system. At my Silicon Valley firm, we support tech entrepreneurs and business owners seeking business-nurturing opportunities that only the U.S. can offer.\n\nMy clients are innovators with big American dreams, founding companies that will create thousands of new jobs — jobs that our economy sorely needs.\n\nPresident Trump announced his intent to suspend all U.S. immigration amid the COVID-19 pandemic and new restrictions may be coming any day. Severely limiting immigration would be a grave mistake.\n\nThe success of America is in large part due to the ingenuity of global transplants. The world has no shortage of brilliant scientists, inventors and entrepreneurs. For decades, they have sought to bring their ideas and their labor to the U.S. We are short-sighted to turn them away.\n\nWe are in a greater economic crisis than any of us have ever experienced. As of this writing, more than 40 million Americans have filed unemployment claims. We can create jobs through innovation and immigration spurs innovation. According to the U.S. Treasury Department, immigrants are measurably more likely than nonimmigrants to start businesses. Immigrants founded 25% of the venture-backed American companies that went public between 1990 and 2005, and 33% of those that have gone public since 2006. More than half of America’s “unicorn” start-ups — those valued at $1 billion or more — are immigrant-founded.\n\nContrary to what Trump claims, America is already unduly hostile to those seeking to put down roots here and live their American dream. Just one example: Although many of the world’s promising minds come to the U.S. to pursue advanced degrees, they overwhelmingly don’t have a way to stay here once their schooling is done. Students who aspire to start businesses here after graduating are forced instead to leave our shores and start over from scratch.\n\nEven for the most starry-eyed innovators, the American dream cannot be attained. Many of the world’s best and brightest, after hitting the U.S. immigration brick wall, will end up being wooed away to other countries. They will take their companies public there, contributing new jobs and tax revenue in their second-choice homes. Meanwhile, the U.S. continues to bleed jobs, with no end in sight to either the pandemic or its cascading economic effects.\n\nAlternatively, for people hoping to enter the U.S. having already embarked on their careers, the coveted H-1B visa is often the only option. Available only to those with specialized skills and a job offer from an American employer, H-1B visas can provide a springboard for ambitious innovators wishing to establish themselves professionally in the U.S. But getting one of these visas requires literally winning a lottery, and the lucky few who are selected have to wait months to actually come here, testing the patience of the employers on whom their visas depend.\n\nAmbitious entrepreneurs could go anywhere in the world. Many countries bend over backward to welcome them, with immigration perks and financial grants to attract start-up founders. But even though we try to shut them out, the world’s best entrepreneurs still fight to come here — with good reason. There are Silicon Alleys and Silicon Beaches elsewhere, but none of them have the same concentration of capital, mentors and skilled professionals. For people who want to start unicorn companies that are really going to change the world, the U.S. has the necessary ingredients to take their ideas to scale — including, now, a rapidly growing pool of job-seekers eager to fill new positions. Additionally, immigrant founders tend to be more open to hiring diverse workforces, thus increasing BIPOC recruitment and retention efforts at scale.\n\nPerhaps in a different climate, we could afford to turn up our noses at innovation from overseas. But not anymore. To truly protect our country, revitalize our economy and create opportunity for all, we would be wise to open our borders wider, not slam them shut.", "url": "https://techcrunch.com/2020/06/22/to-create-the-jobs-our-economy-needs-the-us-must-expand-immigration/"},
{"title": "Watch Apple’s WWDC keynote live right here", "author": "Romain Dillet", "published_at": "2020-06-22 09:56:06", "content": "Apple  is holding a keynote today on the first day of its developer conference, and the company is expected to talk about a ton of software updates. WWDC is a virtual event this year, but you can expect the same amount of news, in a different format. At 10 a.m. PDT (1 p.m. in New York, 6 p.m. in London, 7 p.m. in Paris), you’ll be able to watch the event as the company is streaming it live.\n\nRumor has it that the company plans to unveil new versions of its operating systems. Get ready for iOS 14 and its sibling iPadOS 14, a new version of macOS and some updates for watchOS and tvOS as well.\n\nBut the most interesting rumor of the year is that Apple could announce a major change for the Mac. The company could start using its own in-house ARM systems on a chip instead of Intel’s processors. It would have a ton of consequences for third-party apps running on your Mac as well as Mac hardware in general. Imagine a MacBook with a battery that lasts as long as what you get from an iPad. There could be some more hardware news, such as a new design for the iMac or some Tile-style hardware trackers.\n\nYou can watch the livestream directly on this page, as Apple is streaming its conference on YouTube.\n\nIf you have an Apple TV, you can download the Apple Events app in the App Store. It lets you stream today’s event and rewatch old ones. The app icon was updated a few days ago for the event.\n\nAnd if you don’t have an Apple TV and don’t want to use YouTube, the company also lets you livestream the event from the Apple Events section on its website. This video feed now works in all major browsers — Safari, Microsoft Edge, Google Chrome and Mozilla Firefox.\n\nOf course, you also can read TechCrunch’s live blog if you don’t want to stop everything and watch a video.", "url": "https://techcrunch.com/2020/06/22/watch-apples-wwdc-keynote-live-right-here/"},
{"title": "Five days left to save on Early Stage online", "author": "Alexandra Ames", "published_at": "2020-06-22 10:15:37", "content": "Our inaugural TC Early Stage 2020 event takes place July 21-22, and we’re here to remind you to take advantage of early-bird savings while you still can. The price goes up on June 26, and that means you have just five days left to buy your ticket and keep $50 in your wallet.\n\nWe created TC Early Stage specifically for founders of early-stage startups — from pre-seed through Series A. Attendees can choose from more than 50 sessions that address vital issues that early founders wrestle with as they get their startups off the ground. Each session includes lively, interactive Q&A.\n\nExperts spanning the startup spectrum will lead sessions on core topics ranging from fundraising, tech stack and growth marketing to term sheet construction, recruitment, product management and PR. You’ve got questions and you’ll get answers at Early Stage — along with actionable tips and advice that you can use to move your startup forward.\n\nHere’s a small sample of the sessions you’ll find at Early Stage 2020 (check out the agenda here):\n\nHow to build a tech stack that can go the distance — The beautiful flower of your tech stack starts with a seed and a series of decisions. Which fertilizer will you use? How often should you water it? Where can you give it the right amount of sunlight? Every decision you make about your tech stack affects how it will hold up, and evolve, over time. Hear from HappyFunCorp’s co-founder and CEO Ben Schippers and CTO Jon Evans about how you can avoid regretting those decisions.\n\nHow to get your first yes — Fundraising can be a bit like dominoes. Once you get one investor on board, it’s much easier to bring others along for the ride. But getting that first “yes” can be the most difficult part. Hear the dos and don’ts of hyper-early-stage fundraising from Cyan Banister, seed-stage investor and partner at Founders Fund.\n\nHere’s where you really need to pay attention. We’re limiting each session to 100 people, and it’s a first-come, first-serve situation. If you want to be in a session to get your burning questions answered, buy your ticket now to avoid getting shut out. On the upside, we’ll make videos of all the sessions available on demand after the event.\n\nTC Early Stage takes place July 21-22, but your shot at an early-bird savings ends in just five days, on June 26. Buy your ticket, secure your $50 savings and get a leg up on moving your business forward!\n\nIs your company interested in sponsoring TC Early Stage? Contact our sponsorship sales team by filling out this form.", "url": "https://techcrunch.com/2020/06/22/five-days-left-to-save-on-early-stage-online/"},
{"title": "Apple turns the iPhone into the key for your car", "author": "Matt Burns", "published_at": "2020-06-22 10:39:18", "content": "Today at Apple’s  annual developer conference — held virtually because of COVID — the company announced the ability to control a car with an iPhone. With an upcoming software update, the iPhone can soon unlock and start a car like a standard key. If your car supports it, that is.\n\nDetails are slim at the moment.\n\nInitially, only the upcoming BMW 5 Series will support this feature. Apple expects other manufacturers to support it in the future, too.\n\nSecurity is paramount. Apple says the so-called digital key will live in the secure environment on the owner’s iPhone. It’s not stored in the cloud, but locally on the iPhone. This is the same secure enclave that stores the owner’s Face ID and Wallet information.\n\nOnce the key is added to the iPhone, owners can share the key with other iPhones through iMessage. When sharing, the owner can limit the permissions of the key. Again, details are light, but it seems like this will allow parents to restrict the use of a vehicle to teenagers. Automakers have long offered similar options and enable the owner to put a cap on the rate of speed a person can drive, the volume of the radio and other features. It’s unclear at this point the extent of Apple’s permissions.\n\nApple said that the company is working with car makers to integrate the iPhone’s U1 ultra-wideband chip into this system. If implemented, the range would be greatly increased. Without the U1 chip, the owner would need to hold the phone close to the car so the car can read the phone’s NFC chip. With U1, the range increases dramatically. Apple gave the example of an owner walking up to a car and unlocking it without taking the phone out of a bag.\n\nThis feature will roll out with iOS 14 but will come to iOS 13 devices, too.\n\nA similar feature is available on Android devices with BMW cars. Called, BMW Digital Key, this feature is available with some Samsung Galaxy devices running Android 8.0 or above.", "url": "https://techcrunch.com/2020/06/22/apple-turns-the-iphone-into-the-key-for-your-car/"},
{"title": "NYSE seeks SEC approval for more direct listings", "author": "Jake Bright", "published_at": "2020-06-22 13:38:42", "content": "The New York Stock Exchange filed an amendment today with the Securities and Exchange Commission to allow for more direct listings.\n\nDirect listings offer a more streamlined method for companies to go public and raise capital than traditional IPOs — which entail a lengthy roadshow process and involvement of underwriters to determine valuations and share-prices.\n\nTraditionally, direct listings to raise capital have been available to companies only for follow on raises, after they’d completed the conventional initial public offering process.\n\nThe NYSE allowed tech companies Slack  and Spotify to list directly in 2018 and 2019 and Silicon Valley insiders, such as VC Bill Gurley, have encouraged companies to pursue the method.\n\nAirBNB — which this month revived talks of going public in 2020 — has said it would consider a direct listing rather than a traditional IPO.\n\nThe NYSE filed a proposal with the SEC in December to allow for more direct listings, but that was declined without public comment.\n\nThe amendment offered today provides more details on how the direct listing process — with a capital raise — would work, according to the NYSE’s Vice Chairman, John Tuttle.\n\n“What we did, versus the early versions of the filing, is to [offer] a very granular, mechanical breakdown of how we would execute this type of transaction,” he told TechCrunch on a call.\n\nMost of that surrounds how new shares are numbered, valued and priced in a direct listing. Traditional IPOs rely on underwriters —  that also charge hefty fees — to determine opening share-price, and that can swing widely once the stock actually goes to market.\n\nThe NYSE touts direct listings as a less costly way to go public and one that could lead to a less volatile price discovery process.\n\nOn when the NYSE’s proposed direct listing proposal could be approved or (denied), “The timeline is up to the SEC. Their first deadline for any action is this Saturday,” said Tuttle.\n\nUpdates to the listing process are just some of the changes that could come to New York Stock Exchange. The 228 year old, Wall Street based organization continued trading virtually through the COVID-19 outbreak, using digital platforms.\n\nThe pandemic could lead to the NYSE becoming less of a work from office entity and more a remote, work from home company in the future, Tuttle told TechCrunch in April.", "url": "https://techcrunch.com/2020/06/22/nyse-seeks-sec-approval-for-more-direct-listings/"},
{"title": "3 questions for Lemonade’s IPO", "author": "Alex Wilhelm", "published_at": "2020-06-22 09:58:52", "content": "While we await a fresh IPO filing from heavily backed insurtech startup Lemonade, let’s talk a little more about its public offering.\n\nSince our first dig into its S-1 filing, TechCrunch has spoken to a number of investors and operators in Lemonade’s space to find out if our initial read was off — were we being too generous or too kind to Lemonade  after reading its somewhat complex financial results?\n\nThe Exchange is a daily look at startups and the private markets for Extra Crunch subscribers; use code EXCHANGE to get full access and take 25% off your subscription.\n\nThe short answer is not really, though there are some positive notes and themes worth highlighting. This morning, let’s ask three questions about Lemonade’s IPO filing that will help us understand what’s ahead for the SoftBank-backed unicorn.\n\n1. How quickly can Lemonade accelerate its rental insurance graduation rate?\n\nOn the theme of things that bode well for Lemonade is its ability to “graduate” customers from low-cost rental insurance to more lucrative products.\n\nIn its S-1 filing, Lemonade noted this fact early on. After stating that a “an entry-level $60 a year [rental] policy [corresponds] to $10,000 of possessions,” the company said that as its customers age, they tend to buy more insurance and sometimes swap rental plans for homeowner policies. Moving from the former to the latter is graduating in the company’s parlance.\n\nIf many customers moved from rental insurance to homeowner insurance while keeping Lemonade as their provider, the company could do very well, as illustrated by this section of its SEC filing:", "url": "https://techcrunch.com/2020/06/22/3-questions-for-lemonades-ipo/"},
{"title": "Apple unveils macOS 11.0 Big Sur, featuring a new aesthetic and redesigned apps", "author": "Brian Heater", "published_at": "2020-06-22 11:10:34", "content": "For some time now, macOS has been an also-ran, as Apple has shifted a majority of its focus to its mobile operating systems. Last year’s move to Catalina brought some key changes to the mix, including Sidecar, but many recent updates have centered around making the operating system more iOS-like. The next version of the operating system maintains the recent trend of borrowing its name from some of California’s most beautiful spots. This time it’s the central coast’s Big Sur. And if you care about version numbers, Big Sur is macOS 11.0 according to the “About this Mac” menu that we saw in a live demo.\n\nThe company is doing some refining of all sorts of aesthetics here, including newly designed icons and sounds along with much-improved animations. All of the app’s corners have been rounded and the tool bar has been improved. There are more colors throughout, to distinguish each of the company’s proprietary offerings through new key colors. All of the company’s first-party apps are getting a redesign, as is the menu bar, which features a more iOS-like translucent design.\n\nSpeaking of iOS, Control Center is the latest mobile element borrowed from the mobile version, including the ability to adjust brightness and enter Night Mode in a single spot. Honestly, like many of the recent macOS redesigns, Big Sur borrows A LOT of elements from iOS. That includes widgets and Notification Center. Messages gets a big face lift here, as well — a nice update, given that it’s been a bit lifeless on the desktop. Updates include Memoji editing and pinned messages — an upgrade announced for iOS earlier today.\n\nCatalyst — Apple’s push the bring iOS apps over to the desktop — gets some new developer updates. In fact, it was used to bring over the latest version of Messages and Maps that are being rolled out with Big Sur.\n\nSafari gets a big update this time out, too, including some significant speed improvements. Apple says the browser can open frequently visited pages up to 50% faster than Chrome. The browser gets some key security updates, including monitoring unwanted app tracking. It will also monitor passwords, to cross-check them with data breeches. Like iOS, the browser is also getting a built-in translation feature, to help keep it inline with Google’s offering. ", "url": "https://techcrunch.com/2020/06/22/apple-unveils-macos-10-16-big-sur/"},
{"title": "Apple’s Messages gets better group replies and Memoji updates, including face coverings", "author": "Brian Heater", "published_at": "2020-06-22 10:40:44", "content": "Today’s WWDC keynote has been much more Memoji-centric than usual. The invite art featured them and they were all over the intro. They also got a significant amount of face time during today’s iOS 14 Messages  break down.\n\nAccording to the company the messaging app has experienced a 40% year-over-year increase. The biggest updates to the app include the ability to pin specific messages to the top for easy access, and the ability to reply directly to messages in group chat. Doing so will alert the specific person you’re responding to — a big upgrade for those who rely on Messages for keeping in touch with big groups.\n\nAlso on the plate are 20 new hairstyles and more ages for Memojis, along with additional skin color choices, facial hair and makeup. Also fitting given the … well, state of the world, is the addition of face coverings, including the pictured surgical mask, which, for better or worse, is something we’re going to be living with for a while. That follows other recent accessories additions for the avatars, including last year’s AirPods, glasses and hats.", "url": "https://techcrunch.com/2020/06/22/apples-messages-gets-better-group-replies-and-memoji-updates-including-face-coverings/"},
{"title": "Apple is bringing spatial audio to AirPods Pro", "author": "Brian Heater", "published_at": "2020-06-22 10:58:26", "content": "It’s no AirPods Studio, but Apple’s got a pretty exciting update to last year’s AirPods Pro. The Bluetooth headphones are getting spatial audio (or 3D audio, depending on who you ask). The addition of the feature gives audio a sense of locational awareness, with sound originating from different points. \n\nIt’s a nice addition that should be good for movies where sound location is part of the narrative story telling. More importantly to Apple’s future, however, it will play an interesting role in the company’s push into augmented reality. Apple has been exploring the category through its ARKit for developers and is rumored to be working on an AR headset that would no doubt play nicely with head-tracking earbuds.\n\nAlso of note on the AirPods front is the addition of automatic switching between devices. That’s a big bonus for people who use one set of headphones with different connected products (like most people — we’re not made of money here). With the new feature, both AirPods and AirPods Pro will automatically shift between your iPhone and MacBook, as you perform different tasks. \n\nThe updates will be available through a firmware update. ", "url": "https://techcrunch.com/2020/06/22/apple-is-bringing-spatial-audio-to-airpods-pro/"},
{"title": "iPadOS 14 focuses on giving apps a macOS feel", "author": "Lucas Matney", "published_at": "2020-06-22 11:12:54", "content": "Apple showcased a few new tablet-specific updates coming to iPadOS that aim to appease users hungry for software that treats the devices as laptop replacements.\n\nApple’s iPad-specific updates are fairly low-key this year. The big change is how Apple’s stock apps are being designed with an eye toward sidebars and drop-down menus. It all sounds pretty dry, but it brings a decidedly more complex and macOS-esque design to the iPad making better use of the screen real estate. Apple specifically highlighted design updates to the Photos, Files and Calendar apps.\n\nThe design changes address one of the common complaints around computing on the iPad; that users aren’t able to harness the full power of the device because apps are still being held to iPhone design paradigms. With the company’s new support for multitouch external input like the new Magic Keyboard’s trackpad, Apple’s design needs are moving toward more productivity-minded interfaces that fit more on a single screen. We’ll see how developers choose to change up their iPad designs with these new templates.\n\nSpeaking of fitting more onscreen, the iPad will also be supporting the widening availability of widgets on the home screen. Now that the action is available center stage on iPhone, expect more devs to add support for this.\n\nApple spent the most time of the iPadOS presentation talking about Scribble, a new feature for Apple Pencil that allows users to do more with onscreen handwriting, enabling users to scribble into onscreen text boxes and quickly convert the handwriting to plain text. This means you can write something directly into the Safari search bar and quickly search without tapping on the keyboard. The feature means users have more flexibility to stick with their chosen mode of input.\n\niPadOS arrives in the fall.", "url": "https://techcrunch.com/2020/06/22/ipados-14-focuses-on-giving-apps-a-macos-feel/"},
{"title": "iOS 14 reimagines how you find and use apps with App Clips, widgets and an App Library", "author": "Sarah Perez", "published_at": "2020-06-22 10:36:17", "content": "At Apple’s all-virtual Worldwide Developers Conference, the company introduced several new iOS features designed to help you clean up the mess of icons on your iPhone’s home screen. With iOS 14, users can opt to have iPhone’s software organize their apps for them instead of manually moving them around into folders. The feature will benefit those who now have multiple pages of apps, and often forget where they’ve organized them on back screens. It also introduces the concept of home screen widgets and lightweight apps, called App Clips.\n\nInstead of pages of apps, the new App Library offers a new space at the end of your home screen where all your apps are organized in one simple and easy-to-navigate view.\n\nTo use the feature, you first go into iPhone’s “jiggle mode” to begin organizing apps. But instead of dragging around icons on the home screen or moving them into folders, you can now check off which pages of apps you want hidden from view. The apps on these pages will end up in your App Library, where apps are organized not only in thematic collections — like those you would have made, perhaps — but also into dynamically updated folders.\n\nFor example, a folder called “Suggestions” will house those apps Siri believes you may be looking for next. Another called “Recently Added” will feature apps you’ve recently downloaded. Other folders may include your Apple Arcade downloads, your Social apps, Health & Fitness apps (including Apple’s own Health and Activity apps, for instance), Entertainment apps and so on.\n\nThe apps you use the most from the category will be at the top level for easy launching. In addition, the categories of apps you use most will rise to the top of this screen.\n\nThese categories are automatically created and your apps will be organized for you into the ones where they fit best. These might not be how you would have organized them, necessarily, but it takes the work out of your hands by referencing the app’s existing App Store category to determine its folder. It also offers a way to hide your less-frequently used apps from view.\n\nUp at the top of the App Library, you’ll also have the search field, where you can still get access to all your apps, organized from A to Z.\n\nThe feature was introduced alongside iOS 14 widgets, which lets users — finally — surface rich data from within apps in the form of resizable widgets that sit on your home screen. Before, iOS only allowed for widgets in the Today View, but not on its main screen.\n\nIn another more radical change, Apple introduced the concept of App Clips, which can be launched via a visual code or NFC. A clip, like it sounds, is a small part of an app launched on demand. App Clips can include support for Apple Pay, but are small in size to be quickly downloaded in a time of need — like an app for paying for your parking meter, for instance.\n\nThe idea is not everyone needs a full app download immediately, which takes time. They just need a piece of software that lets you get the job done quickly.\n\nApp Clips will be bundled in with your app in the App Store, similar to how iMessage apps are bundled today — that is, as an extension of the app, under the same store listing. App Clips are also native code, not web technologies.\n\nWith the App Library, widgets, App Clips, and other iOS 14 features, like picture-and-picture, Apple is giving the iPhone a much-need refresh in terms of its user interface at a time when the format of apps tucked inside folders was becoming a little dated. The features will arrive with iOS 14, which launches publicly later this year.", "url": "https://techcrunch.com/2020/06/22/ios-14-reimagines-how-you-find-and-use-apps-with-app-clips-widgets-and-an-app-library/"},
{"title": "Apple’s iOS 14 will give users the option to decline app ad tracking", "author": "Zack Whittaker", "published_at": "2020-06-22 11:23:12", "content": "A new version of iOS wouldn’t be the same without a bunch of security and privacy updates. Apple  on Monday announced a ton of new features it’ll bake into iOS 14, expected out later this year with the release of new iPhones and iPads.\n\nApple said it will allow users to share your approximate location with apps, instead of your precise location. It’ll allow apps to take your rough location without identifying precisely where you are. It’s another option that users have when they give over their location. Last year, Apple allowed users to give over their location once so that apps can’t track a person as they go about their day.\n\niPhones with iOS 14 will also get a camera and microphone recording indicator in the status bar. It’s a similar feature to the camera light that comes with Macs and MacBooks. The recording indicator will sit in the top bar of your iPhone’s display when your front or rear camera is in use, or if a microphone is active.\n\nBut the biggest changes are for app developers themselves, Apple said. In iOS 14, users will be asked if they want to be tracked by the app. That’s a major change that will likely have a ripple effect: By allowing users to reject tracking, it’ll reduce the amount of data that’s collected, preserving user privacy.\n\nApple also said it will also require app developers to self-report the kinds of permissions that their apps request. This will improve transparency, allowing the user to know what kind of data they may have to give over in order to use the app. It also will explain how that collected data could be tracked outside of the app.\n\nAndroid  users have been able to see app permissions for years on the Google Play app store.\n\nThe move is Apple’s latest assault against the ad industry as part of the tech giant’s privacy-conscious mantra.\n\nThe ad industry has frequently been the target of Apple’s barbs, amid a string of controversies that have embroiled both advertisers and data-hungry tech giants, like Facebook and Google,  which make the bulk of their profits from targeted advertising. As far back as 2015, Apple CEO Tim Cook said its Silicon Valley rivals are “gobbling up everything they can learn about you and trying to monetize it.” Apple, which makes its money selling hardware, “elected not to do that,” said Cook.\n\nAs targeted advertising became more invasive, Apple countered by baking in new privacy features to its software, like its intelligence tracking prevention technology and allowing Safari users to install content blockers that prevent ads and trackers from loading.\n\nJust last year Apple told developers to stop using third-party trackers in apps for children or face rejection from the App Store.", "url": "https://techcrunch.com/2020/06/22/apple-ios-14-ad-tracking/"},
{"title": "Apple’s new Translate app works offline with 11 languages", "author": "Devin Coldewey", "published_at": "2020-06-22 10:36:05", "content": "Translation is an everyday smartphone task for millions of people, but outside a few minor features, Apple  has generally ceded the capability to its rivals. That changes today with a new first-party iOS app called, naturally, Translate, which works with 11 languages, no internet connection required.\n\nThe app is intended for use with speech or short written sentences, not to translate whole web pages or documents. The interface is simple, with a language selector, text field and record button as well as a few extra widgets like favorites and a dictionary.\n\nAt launch Translate will support English, Mandarin Chinese, French, German, Spanish, Italian, Japanese, Korean, Arabic, Portuguese and Russian, with others to come. You simply select a pair of languages and paste or record a snippet of text or audio. The translation should show up immediately.\n\nThere’s also a landscape mode that further simplifies the interface:\n\nThe best part is that unlike many translation apps out there, Apple’s is entirely offline, meaning you can use it whether you have a good or bad signal, if you’re out in the middle of nowhere in a country where you don’t get service or if you’re just trying to save data.\n\nThere were no specific release details, so the app will probably appear when you upgrade to iOS 14.", "url": "https://techcrunch.com/2020/06/22/apples-new-translate-app-works-offline-with-11-languages/"},
{"title": "Apple is building its own processors for future Macs", "author": "Brian Heater", "published_at": "2020-06-22 11:34:05", "content": "Apple  just confirmed what is likely the biggest news of today’s WWDC kickoff. Tim Cook officially announced that the company will be producing its own processors for its desktops and laptops — one of the biggest changes in the company’s long computing history. As has been rumored for years now, Apple is moving away from its reliance on Intel chips, into its own ARM-based.\n\nThe move is the next logical step for a company interested in controlling as many aspects of hardware production as possible. It also follows similar moves on the iPhone, iPad and Apple Watch. The company now has several generations of in-house designs for these devices, and it has decided to leverage it for its line computers.\n\nApple contends that its SOCs will be able to provide stronger performance, without sacrificing battery life — a pretty impressive change, if true. Also on-board is the sort of additional security it has offered on its mobile devices, along with improved graphical performance.\n\nWhat’s more — as far as Apple is concerned — this move means its devices use a single processor architecture, which is a big win for cross-platform performance. Unsurprisingly, that also means you’ll be able to run iOS and iPadOS apps directly on the desktop, right out of the box — a big push forward for all of the work the company has been doing with Catalyst on macOS. Likely, however, they won’t function as well as those native apps. \n\nIn spite of the move, however, the company says it’s making it easier for developers to create apps that work on old and new Macs alike — an important caveat given that it’s going to be a while before most users upgrade. A number of developers, including Microsoft, are already developing for the new architecture. \n\nTo ease the transition, Apple’s bringing out a new version of Rosetta — the program that helped make the transition from Power PC. Rosetta 2 will help make sure that apps that have yet to upgrade will still be able to work on the new processors. These will be key aspects of the newly announced macOS 11 Big Sur. \n\nThis being a developer conference, Apple also just announced a Developer Transition Kit to get devs started on the new Macs. The DTK is essentially a souped-up Mac Mini that will give people a head start before the systems actually arrive. The first ARM-based Macs are set to arrive later this year, with the full line transition taking two years. That means there are undoubtedly still some Intel-based systems on the way.\n\nWhile Cook said the company will continue to support the older models, its seems worth holding out on an upgrade to see what the new systems have in store. No specific new systems were announced, but the 13-inch MacBook Pro is expected to be the first system to get the new silicon, with a redesigned iMac expected sometime early next year.\n\nThere are still plenty of unanswered questions on that front. After all, this was a well-polished keynote moving at breakneck speed. The company could only cram in so much. And it seems likely Apple is going to wait on specific product announcements to really drill down on what the new chips will mean in terms of the promised improvements to processing power and battery life.", "url": "https://techcrunch.com/2020/06/22/apple-is-building-its-own-processors-for-future-macs/"},
{"title": "Apple will let users pick their own default email and browser apps", "author": "Lucas Matney", "published_at": "2020-06-22 11:26:51", "content": "Apple quietly made a major announcement that will change life for users of mobile Chrome, Gmail or Outlook. The company is shifting its view on app defaults and will be allowing users to set different app defaults for their mail and browser apps.\n\nThe company specifically denoted that this feature is coming to iPadOS and iOS 14. This likely means users can designate which browser they’re directed to when they tap a link somewhere. We’ll see whether Apple reserves any functionality for its own services. Rather than highlighting this new feature in the keynote, they snuck it into roundup screens that hovered onscreen for a few seconds. It’s hidden in the bottom center of the screen.\n\nThis is a big change for Apple but it’s no surprise they wouldn’t opt to specifically highlight this onstage. Apple has been reluctant to give users the option to use third-party apps as defaults. The big exception to date has been allowing users early on to set Google  Maps as the default over Apple Maps.\n\nEmail and browsing are huge mobile use cases and it’s surprising that users haven’t had this capability to shift defaults to apps like Chrome or Gmail until this upcoming update. As Apple finds itself at the center of more anti-trust conversations, app defaults has been one area that’s always popped up as a method by which Apple promotes its own services over those from other companies.\n\nDetails are scant in terms of what this feature will look like exactly and what services will boast support, but I imagine we’ll hear more as the betas begin rolling out.", "url": "https://techcrunch.com/2020/06/22/apple-will-let-users-pick-their-own-default-email-and-browser-apps/"},
{"title": "Google adds contextual fact-checking for some image search results", "author": "Taylor Hatmaker", "published_at": "2020-06-22 11:14:15", "content": "Acknowledging the role that misleadingly edited or out-of-context images play in seeding the internet with misinformation, Google  is introducing fact-checking labels for some Google image searches. The feature, available starting today, provides a few lines of context with select searches, drawing on services provided by third-party fact-checkers. The tool is powered by publishers themselves, who can now opt to tag images that have been fact-checked using ClaimReview, a method for publishers to communicate to search engines that an image has been verified.\n\n“Photos and videos are an incredible way to help people understand what’s going on in the world,” Google Product Manager Harris Cohen wrote in a blog post announcing the feature. “But the power of visual media has its pitfalls⁠ — especially when there are questions surrounding the origin, authenticity or context of an image.”\n\nGoogle is definitely right about that. Recirculated images tend to pop-up in most major online conspiracy and viral misinformation cycles, and many credulous internet users are content to believe what they can see — even if what they’re seeing was edited or otherwise removed from its context.\n\nIn its announcement, Google provided the example of “sharks swimming in street Houston,” a query that pulls up a perennial viral image offender. In the example search, a fact-check from PolitiFact appears below the original image of the same shark silhouette swimming in the ocean. The addition is just a few lines of text rather than anything flashier, like a colorful label that might indicate more clearly that the content has a special status.\n\nAccording to Google’s announcement, the labels will pop up on “results that come from independent, authoritative sources” that meet its standards. The company notes that the inclusion of fact-checking tags won’t elevate those search results. While more fact-checking and additional context is always a good thing, the new image fact-checking tool only reinforces context from third-party sources already doing this fact-checking work rather than surfacing fact-checking on low-quality websites spreading misinformation.\n\nGoogle appears content to lean on third-parties for much of this kind of work rather than bringing it in-house, but the company did trial a more aggressive, hands-on misinformation strategy for COVID-19. In March, Google began scrubbing false claims from search results and pointing users to verified public health information in searches and on YouTube.\n\nIn spite of running one of the most popular social websites in the world, Google has largely steered clear of engaging in the most fractious current conversations around content moderation and misinformation, exemplified by the ongoing standoff between President Trump and his allies and social networks like Twitter and Facebook.\n\nThose companies have signaled opposite strategies toward moderation in recent weeks, with Twitter making increasingly hands-on decisions about what violates its rules while Facebook intervenes only in the most egregious cases. But even if Google mostly succeeds in staying above the fray, the company faces the same existential threat from political figures who seek to punish social media companies by revoking the legal protections that make their businesses possible.\n\nStill, Google did dip its toes into that ongoing conflict last week, when the company confirmed it had removed the right-wing website ZeroHedge from its ad platform for violating its rules against hate and discriminatory content. The company also issued a warning to The Federalist, another far-right site, for similar violations.", "url": "https://techcrunch.com/2020/06/22/google-image-fact-checking/"},
{"title": "watchOS 7’s ‘Face Sharing’ feature can help custom watch faces go viral", "author": "Sarah Perez", "published_at": "2020-06-22 11:13:16", "content": "Apple at its Worldwide Developers Conference this morning announced a much-requested feature for Apple Watch: the ability to customize and share third-party watch faces with others. There are now over 20,000 Watch apps available on the Apple Watch App Store, but what has been missing was the ability to fully use all the data from your favorite apps in a single face on your Watch’s main screen. That’s now changing with watchOS 7, says Apple.\n\nWith the new software, developers will be able to create multiple, custom complications per app, which then can be used to create custom watch faces. For example, a surf app’s developer could create a “Surf Watch” face that shows things like water temperature, swell and wind speed predictions for your favorite beach. Parents can use the Glow Baby app to track changing and feeding times. Nike Run Club can display stats like the pace from your last run and your weekly run goals.\n\nThe developers will be able to build these new complications with SwiftUI, notes Apple.\n\nAlso in watchOS 7, users will be able to share their favorite watch faces that take advantage of all these new custom complications.\n\nIn the watchOS App Store, users will be able to discover curated watch faces from third-party apps. But they can also share watch faces they find on the App Store or elsewhere with family and friends through a new sharing feature.\n\nNow, when you see a watch face you want to share, you just long press on the face to share it and pick a contact to send it to. Developers can also offer preconfigured watch faces right from their apps, and faces can be shared across social media, which could allow for watch faces to go viral in a way they’ve never been able to do before.\n\nThe feature could serve to add vitality to the watch platform whose app ecosystem has lagged behind that of other Apple platforms, like iOS.\n\nApple also says it’s bringing rich complications to more of its own watch faces, including a new chronograph face with a tachometer and an updated XL face. ", "url": "https://techcrunch.com/2020/06/22/watchos-7s-face-sharing-feature-can-help-custom-watch-faces-go-viral/"},
{"title": "The Apple Watch can soon track sleep", "author": "Matt Burns", "published_at": "2020-06-22 11:10:11", "content": "Apple  just announced a long-requested feature for the Apple Watch: sleep tracking. With this new feature, users can not only track sleep but create what Apple says is a holistic approach to improving sleep.\n\nThe sleep-tracking function works in conjunction with an iPhone to help a person create a better sleep routine. This feature is called Wind Down and is designed to reduce distractions on the iPhone and Apple Watch. When activated, the phone displays additional information on the lock screen, including how long it is until bedtime (pre-set by the user), and turns on Do Not Disturb. This screen prompts users to relax and meditate — instead of, you know, endlessly scrolling Reddit. When it’s time to wake up, the alarm screen has been reworked and now features a link to Shortcuts, making it easier to launch daily apps.\n\nOn the Apple Watch, when Wind Down is activated, the user’s default complication is replaced by a simple watch face.\n\nTo track sleep, the Apple Watch follows the user’s micro-movements and the rise and fall of the user’s breath. This information can be displayed on the Apple Watch or iPhone.\n\nThis isn’t Apple’s first foray into sleep tracking. In 2017, the company purchased the company Beddit, a device that goes on a mattress and tracks the user’s sleep. That company is still operating and available for purchase. At this time, it’s unclear if any technology or strategy is shared between the two parts of Apple.\n\nSleep tracking will come to iOS 14 and watchOS 7 later this year. The iPhone portion works independently from the Watch version, allowing users without an Apple Watch to still utilize the bedtime and wake-up features.", "url": "https://techcrunch.com/2020/06/22/the-apple-watch-can-soon-track-sleep/"}
]